public_html/Shell/tips-and-tricks.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-06-11 Thu 04:17 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>cmd Tips &amp; Tricks</title>
<meta name="generator" content="Org mode">
<meta name="author" content="John Doe">
<meta name="description" content="Tips &amp; Tricks for making your life easier when publishing blogs with emacs on minimum steroids."
>
<meta property="og:title" content="cmd Tips & Tricks" />
<meta property="og:description" content="Tips & Tricks for making your life easier when publishing blogs with emacs on minimum steroids." />
<meta property="og:type" content="website" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">cmd Tips &amp; Tricks</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org73edbbc">1. Command Line</a>
<ul>
<li><a href="#org47fba51">1.1. Unzipping files modified in a specific date</a></li>
<li><a href="#orgad5e081">1.2. AWS RDS (Postgres)</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org73edbbc" class="outline-2">
<h2 id="org73edbbc"><span class="section-number-2">1</span> Command Line</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org47fba51" class="outline-3">
<h3 id="org47fba51"><span class="section-number-3">1.1</span> Unzipping files modified in a specific date</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-cmd">ls -la | awk 'NR&gt;2 {if($7==26 &amp;&amp; $6=="Mar") print "./"$9;}' | xargs -n1 unzip -d ../cases/week_03/
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad5e081" class="outline-3">
<h3 id="orgad5e081"><span class="section-number-3">1.2</span> AWS RDS (Postgres)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In the prompt to crate a new database <b><b>I think</b></b> the prompt asked me for a database name, but in reality what the web app refers to is the server name or at least an identifier within AWS. The sefault database that is created has the <b><b>postgres</b></b> name, and if you provide no argument specifying it to the psql utility it uses your username as the dbname which could be the default - <b><b>postgres</b></b> - but using a different one seems more secure to me.
</p>

<div class="org-src-container">
<pre class="src src-shell">psql -h &lt;server_name&gt;.<span style="color: #51afef;">{</span>secret<span style="color: #51afef;">}</span>.us-west-2.rds.amazonaws.com -U leetdatageek --password --dbname=postgres
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Doe</p>
<p class="date">Created: 2020-06-11 Thu 04:17</p>
</div>
</body>
</html>
